validationCases/S1_Ma633/OF/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cmiFoam_dev;

startFrom       latestTime; //startTime, firstTime or latestTime

startTime       0;

stopAt          endTime;

endTime         25;

deltaT          0.0005;

writeControl    adjustableRunTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;
maxAlphaCo      0.5;

maxDeltaT       0.001;
// ************************************************************************* //

functions
{
  rhoIntegral //user defined name of the dictionary
  {
    libs ("libutilityFunctionObjects.so");
    type coded; //will be a dynamicCode compiled function
    name rhoIntegral; //its name is
    enabled true;

    codeExecute //not code but codeExecutee
    #{
      const volScalarField& rho = mesh().lookupObject<volScalarField>("rho");
      scalar volIntegral = 0; //reset to zero
      forAll (rho, cellI) //for each cell with a magU, do this
      {
        volIntegral += 1000000*rho[cellI]*mesh().V()[cellI]; //rho*cellVolume ~mass
      }
      reduce(volIntegral, sumOp<scalar>()); //fixes mpi

      Info <<"totalMass: " << volIntegral << " milligrams" << endl;

      scalar massConservation = volIntegral/(721.81105) - 1; //current over initial
      Info <<"massErr: " << massConservation << nl << endl;

    #};
  }
}
