validationCases/S1_Ma633/OF/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
              // kg m s
dimensions      [1 -1 -2 0 0 0 0]; // Pascals

internalField   uniform 101325;

boundaryField
{
  bottom
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }
  top
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }

  sym{type empty;}

  left
  {
    type            fixedFluxPressure;
    value           uniform 0;
      }
  right
  {
    type            fixedFluxPressure;
    value           uniform 0;
     }
}

// ************************************************************************* //
